_Rarzrabotki/Rarus/USO2/Documents/УСОERP_УстановкаПараметровУчетаПоСтроительству.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_УстановкаПараметровУчетаПоСтроительству</Name>
			<Comment>Установка параметров учета по строительству (УСО)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УСОERP_ПараметрыРаспределенияНДСВСтроительстве</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаспределениеНДС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетЗатрат</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилоРаспределенияНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_ПравилаРаспределенияНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходовДляВведенныхВЭксплуатацию</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходовДляНеВведенныхВЭксплуатацию</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСписанияНДС1</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопАналитика1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСписанияДляВведенныхОбъектов</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходовДляВведенныхОбъектов</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСписанияДляВводимыхОбъектов</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаФинансовогоУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСписанияНДС2</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопАналитика2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСписанияНДС3</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопАналитика3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоДляВведенныхОбъектов</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопАналитикаЗатрат</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВосстановлениеНДСПриСдачеОбъектаСтроительства</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_УстановкаПараметровУчетаПоСтроительству/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	//ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	

	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	УстановитьВидимостьСтраниц();
	
	ОбновитьПредставлениеСчетаСписанияНДС();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	ПриЧтенииСозданииНаСервере();
	
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	СобытияФорм.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПредставлениеСчетаСписанияНДС();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УстановкаПараметровУчетаРезерваПриИзменении(Элемент)
	УстановитьВидимостьСтраниц();
КонецПроцедуры

&НаКлиенте
Процедура УстановкаПараметровРаспределенияНДСПриИзменении(Элемент)
	УстановитьВидимостьСтраниц();
КонецПроцедуры

&НаКлиенте
Процедура УстановкаПараметровРасчетаНДСДляКомплексныхРасходовПриИзменении(Элемент)
	
	УстановитьВидимостьСтраниц();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыРезервы

&НаКлиенте
Процедура РезервыСчетРезерваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ФормаВыбора = ПолучитьФорму("ПланСчетов.Хозрасчетный.ФормаВыбора",, Элемент);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаВыбора.Список, "Ссылка", ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.РезервыПредстоящихРасходов"), ВидСравненияКомпоновкиДанных.ВИерархии,, Истина);
	ФормаВыбора.Открыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыРаспределениеНДС

&НаКлиенте
Процедура РаспределениеНДСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле = Элементы.РаспределениеНДСПредставлениеСписанияНДС1 
		ИЛИ Поле = Элементы.РаспределениеНДСПредставлениеСписанияНДС2
		ИЛИ Поле = Элементы.РаспределениеНДСПредставлениеСписанияНДС3 Тогда
		
		ТекущиеДанные = Элементы.РаспределениеНДС.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Индекс = СтрЗаменить( Поле.Имя, "РаспределениеНДСПредставлениеСписанияНДС", "");
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СчетСписанияНДС", 		ТекущиеДанные["СчетСписанияНДС" + Строка(Индекс)]);
		ПараметрыФормы.Вставить("ДопАналитика", 		ТекущиеДанные["ДопАналитика" + Строка(Индекс)]);
		ПараметрыФормы.Вставить("ДопАналитикаЗатрат", 	ТекущиеДанные["ДопАналитикаЗатрат"]);
		ПараметрыФормы.Вставить("ИдентификаторСтроки", 	ТекущиеДанные.ПолучитьИдентификатор());
		ПараметрыФормы.Вставить("Индекс", 				Индекс);
		ПараметрыФормы.Вставить("СчетЗатрат", 			ТекущиеДанные.СчетЗатрат);
		
		ОткрытьФорму("Документ.УСОERP_УстановкаПараметровУчетаПоСтроительству.Форма.ФормаВыбораСчетаСписанияНДС", ПараметрыФормы, Элемент, ,,, Новый ОписаниеОповещения("ПредставлениеСписанияНДСВыборЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		СтандартнаяОбработка = Ложь;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеСписанияНДСВыборЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВыбора = Неопределено Тогда
		Индекс = РезультатВыбора.Индекс;
		ТекущиеДанные = Объект.РаспределениеНДС.НайтиПоИдентификатору(РезультатВыбора.ИдентификаторСтроки);
		ТекущиеДанные["СчетСписанияНДС" + Строка(Индекс)] = РезультатВыбора.СчетСписанияНДС;
		ТекущиеДанные["ДопАналитика" 	+ Строка(Индекс)] = РезультатВыбора.ДопАналитика;
		ТекущиеДанные["ДопАналитикаЗатрат"] = РезультатВыбора.ДопАналитикаЗатрат;
		ТекущиеДанные["ПредставлениеСписанияНДС" + Строка(Индекс)] = Строка(ТекущиеДанные["СчетСписанияНДС" + Строка(Индекс)]) 
																	+ Строка(?(ЗначениеЗаполнено(ТекущиеДанные["ДопАналитика" + Строка(Индекс)]), ", " + ТекущиеДанные["ДопАналитика" + Строка(Индекс)], ""))
																	+ Строка(?(ЗначениеЗаполнено(ТекущиеДанные["ДопАналитикаЗатрат"]), ", " + ТекущиеДанные["ДопАналитикаЗатрат"], ""));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемы
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаспределениеНДСПредставлениеСписанияНДС1.Имя);
		
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста",  ЦветаСтиля.ЦветГиперссылки);

	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаспределениеНДСПредставлениеСписанияНДС1.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.РаспределениеНДС.ПредставлениеСписанияНДС1");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст",  НСтр("ru = '<Совпадает со счетом затрат>'"));
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаспределениеНДСПредставлениеСписанияНДС2.Имя);
		
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста",  ЦветаСтиля.ЦветГиперссылки);

	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаспределениеНДСПредставлениеСписанияНДС2.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.РаспределениеНДС.ПредставлениеСписанияНДС2");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст",  НСтр("ru = '<Совпадает со счетом затрат>'"));

	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаспределениеНДСПредставлениеСписанияНДС3.Имя);
		
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста",  ЦветаСтиля.ЦветГиперссылки);

	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаспределениеНДСПредставлениеСписанияНДС3.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.РаспределениеНДС.ПредставлениеСписанияНДС3");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст",  НСтр("ru = '<Совпадает со счетом затрат>'"));

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	 
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСтраниц()
	
	//Элементы.СтраницаУчетРезервов.Видимость 					= Объект.УстановкаПараметровУчетаРезерва;
	//Элементы.СтраницаРаспределениеНДС.Видимость 				= Объект.УстановкаПараметровРаспределенияНДС;
	//Элементы.СтраницаРасчетНДСДляКомплексныхРасходов.Видимость 	= Объект.УстановкаПараметровРасчетаНДСДляКомплексныхРасходов;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеСчетаСписанияНДС()
	
	Для Каждого СтрТЗ Из Объект.РаспределениеНДС Цикл
		СтрТЗ.ПредставлениеСписанияНДС1 = Строка(СтрТЗ.СчетСписанияНДС1) + Строка(?(ЗначениеЗаполнено(СтрТЗ.ДопАналитика1), ", " + Строка(СтрТЗ.ДопАналитика1), "")) + Строка(?(ЗначениеЗаполнено(СтрТЗ.ДопАналитикаЗатрат), ", " + Строка(СтрТЗ.ДопАналитикаЗатрат), ""));
		СтрТЗ.ПредставлениеСписанияНДС2 = Строка(СтрТЗ.СчетСписанияНДС2) + Строка(?(ЗначениеЗаполнено(СтрТЗ.ДопАналитика2), ", " + СтрТЗ.ДопАналитика2, ""));
		СтрТЗ.ПредставлениеСписанияНДС3 = Строка(СтрТЗ.СчетСписанияНДС3) + Строка(?(ЗначениеЗаполнено(СтрТЗ.ДопАналитика3), ", " + СтрТЗ.ДопАналитика3, ""));
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти
